In [1]:
# import necessary libraries
import numpy as np
import pandas as pd

In [2]:
# read the dataset
dataset = pd.read_csv('../data/data.csv')
dataset.head()

,COUNTRY,CODE_TIME,TIME,YEAR,MONTH,MONTH_NAME,PRODUCT,VALUE,DISPLAY_ORDER,yearToDate,previousYearToDate,share
0,Australia,JAN2010,January 2010,2010,1,January,Hydro,990.728,1,16471.891,NaN,0.047771
1,Australia,JAN2010,January 2010,2010,1,January,Wind,409.469,2,4940.909,NaN,0.019744
2,Australia,JAN2010,January 2010,2010,1,January,Solar,49.216,3,908.238,NaN,0.002373
3,Australia,JAN2010,January 2010,2010,1,January,Geothermal,0.083,4,0.996,NaN,0.000004
4,Australia,JAN2010,January 2010,2010,1,January,Total combustible fuels,19289.730,7,214302.969,NaN,0.930108

In [3]:
# Display the shape of the dataset
dataset.shape

(181915, 12)

In [4]:
# Define a list of European countries
european_countries = [
    "Austria", "Belgium", "Bulgaria", "Croatia", "Cyprus", "Czech Republic", "Denmark",
    "Estonia", "Finland", "France", "Germany", "Greece", "Hungary", "Iceland", "Ireland",
    "Italy", "Latvia", "Lithuania", "Luxembourg", "Malta", "Netherlands", "North Macedonia",
    "Norway", "Poland", "Portugal", "Republic of Turkiye", "Romania", "Serbia",
    "Slovak Republic", "Slovenia", "Spain", "Sweden", "Switzerland", "United Kingdom"
]

# Filter only rows with European countries
df_europe = dataset[dataset['COUNTRY'].isin(european_countries)]

# Save the filtered data to a new CSV (optional)
df_europe.to_csv("../data/european_countries_dataset.csv", index=False)

# Preview the result
df_europe.head()

,COUNTRY,CODE_TIME,TIME,YEAR,MONTH,MONTH_NAME,PRODUCT,VALUE,DISPLAY_ORDER,yearToDate,previousYearToDate,share
20,Austria,JAN2010,January 2010,2010,1,January,Hydro,2579.264,1,39502.566,NaN,0.437055
21,Austria,JAN2010,January 2010,2010,1,January,Wind,200.966,2,1961.814,NaN,0.034054
22,Austria,JAN2010,January 2010,2010,1,January,Solar,2.864,3,84.421,NaN,0.000485
23,Austria,JAN2010,January 2010,2010,1,January,Geothermal,0.111,4,1.332,NaN,0.000019
24,Austria,JAN2010,January 2010,2010,1,January,Total combustible fuels,3117.160,7,26042.221,NaN,0.528201

In [5]:
# Display the shape of the filtered dataset
df_europe.shape

(120353, 12)

In [8]:
# Ensure df_europe is a deep copy
df_europe = df_europe.copy()

# Convert column names to lowercase
df_europe.columns = df_europe.columns.str.lower()

# Rename 'country' to 'country_name'
df_europe = df_europe.rename(columns={'country': 'country_name'})

df_europe.head()

,country_name,code_time,time,year,month,month_name,product,value,display_order,yeartodate,previousyeartodate,share
20,Austria,JAN2010,January 2010,2010,1,January,Hydro,2579.264,1,39502.566,NaN,0.437055
21,Austria,JAN2010,January 2010,2010,1,January,Wind,200.966,2,1961.814,NaN,0.034054
22,Austria,JAN2010,January 2010,2010,1,January,Solar,2.864,3,84.421,NaN,0.000485
23,Austria,JAN2010,January 2010,2010,1,January,Geothermal,0.111,4,1.332,NaN,0.000019
24,Austria,JAN2010,January 2010,2010,1,January,Total combustible fuels,3117.160,7,26042.221,NaN,0.528201

In [9]:
# Ensure df_europe is a deep copy
df_europe = df_europe.copy()

# Drop unnecessary columns (without inplace)
columns_to_drop = ['time', 'code_time', 'month_name', 'display_order']
df_europe = df_europe.drop(columns=columns_to_drop)

df_europe.head()

,country_name,year,month,product,value,yeartodate,previousyeartodate,share
20,Austria,2010,1,Hydro,2579.264,39502.566,NaN,0.437055
21,Austria,2010,1,Wind,200.966,1961.814,NaN,0.034054
22,Austria,2010,1,Solar,2.864,84.421,NaN,0.000485
23,Austria,2010,1,Geothermal,0.111,1.332,NaN,0.000019
24,Austria,2010,1,Total combustible fuels,3117.160,26042.221,NaN,0.528201

In [10]:
df_europe.shape

(120353, 8)

In [11]:
# Create a 'date' column from 'year' and 'month' columns
df_europe['date'] = pd.to_datetime(df_europe[['year', 'month']].assign(day=1))

In [13]:
df_europe = df_europe.sort_values(by='date')
df_europe.head()

,country_name,year,month,product,value,yeartodate,previousyeartodate,share,date
20,Austria,2010,1,Hydro,2579.264,39502.566,NaN,0.437055,2010-01-01
22,Austria,2010,1,Solar,2.864,84.421,NaN,0.000485,2010-01-01
23,Austria,2010,1,Geothermal,0.111,1.332,NaN,0.000019,2010-01-01
24,Austria,2010,1,Total combustible fuels,3117.160,26042.221,NaN,0.528201,2010-01-01
25,Austria,2010,1,Coal,693.730,6371.891,NaN,0.117552,2010-01-01

In [14]:
# check for missing values in the DataFrame
df_europe.isnull().sum()

country_name              0
year                      0
month                     0
product                   0
value                     0
yeartodate                0
previousyeartodate    11303
share                     0
date                      0
dtype: int64

In [15]:
# fill 0 for missing values in 'previousyeartodate' column
df_europe['previousyeartodate'] = df_europe['previousyeartodate'].fillna(0)
df_europe.isnull().sum()

country_name          0
year                  0
month                 0
product               0
value                 0
yeartodate            0
previousyeartodate    0
share                 0
date                  0
dtype: int64

In [16]:
# Display the data types of the columns in the DataFrame 
df_europe.dtypes

country_name                  object
year                           int64
month                          int64
product                       object
value                        float64
yeartodate                   float64
previousyeartodate           float64
share                        float64
date                  datetime64[ns]
dtype: object

In [17]:
# Check for duplicate rows in the DataFrame
df_europe.duplicated().sum()

np.int64(0)

In [18]:
# Check unique values in the 'product' column
df_europe['product'].unique()

array(['Hydro', 'Solar', 'Geothermal', 'Total combustible fuels', 'Coal',
       'Oil', 'Natural gas', 'Electricity trade', 'Fossil fuels',
       'Combustible renewables', 'Net electricity production',
       'Total imports', 'Total exports', 'Electricity supplied',
       'Used for pumped storage', 'Distribution losses',
       'Other combustible non-renewables', 'Not specified',
       'Final consumption', 'Other renewables aggregated', 'Low carbon',
       'Wind', 'Non-renewables', 'Renewables', 'Nuclear', 'Others',
       'Other renewables'], dtype=object)

In [19]:
df_europe.describe()

,year,month,value,yeartodate,previousyeartodate,share,date
count,120353.000000,120353.000000,120353.000000,120353.000000,120353.000000,120353.000000,120353
mean,2016.440413,6.498641,2609.487572,31313.512400,15746.183613,0.301300,2016-11-23 21:33:00.743313408
min,2010.000000,1.000000,-4837.906000,-46377.998000,-46377.998000,-4.649269,2010-01-01 00:00:00
25%,2013.000000,3.000000,36.815000,464.999000,58.396000,0.010779,2013-11-01 00:00:00
50%,2017.000000,6.000000,385.315000,4758.000000,1531.034517,0.091781,2017-04-01 00:00:00
75%,2020.000000,9.000000,1990.309330,24295.414000,9808.683000,0.524859,2020-02-01 00:00:00
max,2022.000000,12.000000,61855.823000,619053.007000,619053.007000,5.649269,2022-12-01 00:00:00
std,3.662333,3.452622,6289.073402,74771.205992,45264.801362,0.461476,NaN